; domain
(define (domain domain2)

(:requirements :strips :typing :negative-preconditions :equality)

(:types
    location                            ; locations
    warehouse ws_location - location    ; there can't be workstation in warehouse

    locatable - object      ; parent type for agents, supplies, boxes, workstations, carriers
                            ; to allow located(locatable, location)

    agent - locatable       ; the robotic agents
    agent_type_1 drone - agent

    carrier - locatable     ; the carrier for the agents

    supply - locatable      ; supplies needed by the workstations

    box - locatable         ; boxes containing needed supplies

    workstation - locatable ; there are a number of workstations

    quantity - object       ; quantity type, used fot the increase/decrease and keep track of capacity
)

(:constants
    q0 - quantity  ; empty quantity constant
)

(:predicates
    (connected ?l1 ?l2 - location)          ; location ?l1 is connected to ?l2 - the "roadmap"

    (located ?x - locatable ?l - location) ; ?x is at location ?l

    (contains ?b - box ?s - supply)         ; box ?b contains supply ?s
    (isempty ?b - box)                      ; box ?b is empty

    (loaded ?c - carrier ?b - box)          ; box ?b is loaded on carrier ?c
    (unloaded ?b - box)                     ; box ?b is unloaded, not on an agent

    (has ?w - workstation ?s - supply)      ; workstation ?w has supply ?s
    (needs ?w - workstation ?s - supply)     ; workstation ?w needs supply ?s

    (has_carrier ?a - agent ?c - carrier)       ; agent ?a has carrier ?c

    ; increment decrement predicates
    (inc ?q ?q_new - quantity)
    (dec ?q ?q_new - quantity)

    ; predicate to handle the capacity of the carrier
    (available_slots ?c - carrier ?q - quantity)        ; true <=> ?c has ?q available spots left 
                                                                ; available_slots(?c q0) == TRUE -> ?c is full
    
    ; predicate to keep track of the number of filled boxes in the carrier
    ; used for checking when the agent can go back to warehouse, that is when he finished the deliveries, so no filled boxes
    (current_filled_boxes ?c - carrier ?q - quantity)
)


;;; ---------------------
;;; fill empty actions
;;; ---------------------


; agent ?a fills box ?b with supply ?s at location ?l
(:action fill
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?s ?l)     ; agent, box, supply in the same location
        (isempty ?b) (unloaded ?b)                          ; box empty and unloaded
    )
    :effect (and 
        (not (isempty ?b)) (contains ?b ?s)
    )
)

; agent ?a empty box ?b in location ?l, leaving supply ?s to workstation ?w
(:action empty
    :parameters (?a - agent ?b - box ?s - supply ?w - workstation ?l - location)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?w ?l)     ; agent, box, workstation in the same location
        (contains ?b ?s) (needs ?w ?s)                      ; box must contain the needed supply for the workstation
        (unloaded ?b)                                       ; box unloaded
    )
    :effect (and 
        (has ?w ?s) (not (needs ?w ?s))         ; cause the workstation to have it 
        (not (contains ?b ?s)) (isempty ?b)     ; and the box becomes empty 
    )
)


;;; ---------------------
;;; move action for agent, when it moves without the carrier
;;; If for some reason initially the agent is not in the same location of the carrier
;;; this action is used, after the agent reaches the carrier, they always moves together
;;; ---------------------

(:action move-to-carrier
    :parameters (?a - agent ?c - carrier ?from ?to - location)
    :precondition (and 
        (located ?a ?from)          ; agent must be in ?from
        (not (located ?c ?from))    ; carrier must not be in ?from
        (has_carrier ?a ?c)         ; ?c must be ?a carrier

        (connected ?from ?to)       ; ?from, ?to must be connected
    )
    :effect (and 
        (not (located ?a ?from)) (located ?a ?to)
    )
)


;;; ---------------------
;;; move actions for agent moving the carrier
;;; ---------------------

; agent ?a moves carrier ?c from location ?from to location ?to, 
; where ?to is not the warehouse
(:action move-carrier-to-workstations
    :parameters (?a - agent ?c - carrier ?from - location ?to - ws_location)
    :precondition (and 
        (located ?a ?from)                  ; agent must be in ?from
        (located ?c ?from)                  ; carrier ?c must be agent ?a carrier
        (connected ?from ?to)               ; ?from, ?to must be connected
        (has_carrier ?a ?c)                 ; ?c must be ?a carrier
        
        ; an agent can move to a workstation location also without filled boxes
        ; for example it may go to a workstation-location to load empty boxes and bring them back to warehouse
        ; so I don't add the following precondition: (not (current_filled_boxes ?c q0))
    )  
    :effect (and 
        (not (located ?a ?from)) (located ?a ?to) 
        (not (located ?c ?from)) (located ?c ?to)
    )
)

; agent ?a moves carrier ?c from location ?from to warehouse ?to, 
; to return at warehouse the carrier must be without filled boxes (it must have no more supply to deliver)
(:action move-carrier-to-warehouse
    :parameters (?a - agent ?c - carrier ?from - location ?to - warehouse)
    :precondition (and 
        (located ?a ?from)              ; agent must be in ?from
        (located ?c ?from)              ; carrier ?c must be agent ?a carrier
        (connected ?from ?to)           ; ?from, ?to must be connected 
        (has_carrier ?a ?c)             ; ?c must be ?a carrier
        (current_filled_boxes ?c q0)    ; agent can go back to warehouse only if carrier has no supplies left to deliver
    )    
    :effect (and                        ; update agent and carrier position
        (not (located ?a ?from)) (located ?a ?to)
        (not (located ?c ?from)) (located ?c ?to)
    )
)


;;; ---------------------
;;; load unload actions
;;; since not all planners support the conditional effect (if the box is filled or not gives me different effects),
;;; so, I duplicated the actions for the empty boxes and the filled box 
;;; ---------------------

; agent ?a loads filled box ?b on carrier ?c at location ?l
(:action load-filled
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?q ?q_new ?n ?n_new - quantity)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?c ?l) ; agent, box, carrier in the same location
        (has_carrier ?a ?c)                             ; carrier ?c must be agent ?a carrier
        (unloaded ?b)                                   ; box unloaded 
        (not (isempty ?b))                              ; box must be filled
        
        (available_slots ?c ?q)
        (dec ?q ?q_new)
        (not (= ?q q0))                   ; check if carrier not full

        (current_filled_boxes ?c ?n)
        (inc ?n ?n_new)
    )
    :effect (and
        (loaded ?c ?b) (not (unloaded ?b))      ; box is loaded
        (not (located ?b ?l))                   ; box no more at l

        (available_slots ?c ?q_new) (not (available_slots ?c ?q))   ; update quantity in carrier

        (current_filled_boxes ?c ?n_new)    ; increase the number of filled boxes
        (not (current_filled_boxes ?c ?n))
    )
)

; agent ?a loads empty box ?b on carrier ?c at location ?l
(:action load-empty
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?q ?q_new - quantity)
    :precondition (and 
        (located ?a ?l) (located ?b ?l) (located ?c ?l) ; agent, box, carrier in the same location
        (has_carrier ?a ?c)                             ; carrier ?c must be agent ?a carrier
        (unloaded ?b)                                   ; box unloaded 
        (isempty ?b)                                    ; box must be empty
        
        (available_slots ?c ?q)
        (dec ?q ?q_new)
        (not (= ?q q0))                   ; check if carrier not full
    )
    :effect (and
        (loaded ?c ?b) (not (unloaded ?b))      ; box is loaded
        (not (located ?b ?l))                   ; box no more at l

        (available_slots ?c ?q_new) (not (available_slots ?c ?q))   ; update quantity in carrier
    )
)

; agent ?a unloads filled box ?b from carrier ?c at location ?l
(:action unload-filled
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?q ?q_new ?n ?n_new - quantity)
    :precondition (and 
        (located ?a ?l) (located ?c ?l)     ; agent, carrier in the same location  
        (has_carrier ?a ?c)                 ; carrier ?c must be agent ?a carrier
        (loaded ?c ?b)                      ; box ?b should be loaded on carrier ?c
        (not (isempty ?b))                  ; box must be filled
        
        (available_slots ?c ?q)
        (inc ?q ?q_new)

        (current_filled_boxes ?c ?n)
        (dec ?n ?n_new)
    )
    :effect (and 
        (unloaded ?b) (not (loaded ?c ?b))  ; box is unloaded
        (located ?b ?l)                     ; box is now located at unload location

        (available_slots ?c ?q_new) (not (available_slots ?c ?q))   ; update quantity in carrier

        (current_filled_boxes ?c ?n_new)    ; decrease the number of filled boxes
        (not (current_filled_boxes ?c ?n))
    )
)

; agent ?a unloads empty box ?b from carrier ?c at location ?l
(:action unload-empty
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?q ?q_new - quantity)
    :precondition (and 
        (located ?a ?l) (located ?c ?l)     ; agent, carrier in the same location  
        (has_carrier ?a ?c)                 ; carrier ?c must be agent ?a carrier
        (loaded ?c ?b)                      ; box ?b should be loaded on carrier ?c
        (isempty ?b)                        ; box must be empty
        
        (available_slots ?c ?q)
        (inc ?q ?q_new)
    )
    :effect (and 
        (unloaded ?b) (not (loaded ?c ?b))  ; box is unloaded
        (located ?b ?l)                     ; box is now located at unload location
        (available_slots ?c ?q_new) (not (available_slots ?c ?q))   ; update quantity in carrier
    )
)

)

; problem
(define (problem problem2) (:domain domain2)
(:objects 

    ; locations
    central_warehouse - warehouse 
    loc1 loc2 loc3 - ws_location

    ; 2 boxes
    box1 box2 box3 - box

    ; 3 workstations
    ws1 ws2 ws3 ws4 - workstation

    ; robotic agent
    agent1 - agent_type_1

    ; carrier for agent1
    carrier1 - carrier

    ; supplies
    bolt valve tool - supply

    ; define quantities up to the largest quantity that appears in the problem
    ; q0 already defined as constant in domain 
    q1 q2 q3 q4 - quantity
)

(:init
    
    ; all boxes at central_warehouse
    (located box1 central_warehouse)
    (located box2 central_warehouse)
    (located box3 central_warehouse)

    ; all the boxes are empty and unloaded (not on agents)
    (isempty box1)
    (unloaded box1)
    (isempty box2)
    (unloaded box2)
    (isempty box3)
    (unloaded box3)

    ; all content/supply at central_warehouse
    (located bolt central_warehouse)
    (located valve central_warehouse)
    (located tool central_warehouse)

    ; robotic agent and carrier at central_warehouse and free
    (located agent1 central_warehouse)
    (located carrier1 central_warehouse)

    ; carrier1 is agent1's carrier
    (has_carrier agent1 carrier1)

    ; carrier1 has maximum capacity 3 and initially has no filled boxes
    (available_slots carrier1 q3)
    (current_filled_boxes carrier1 q0)

    ; workstations ws1 and ws2 at loc1
    ; workstation ws3 at loc2
    (located ws1 loc1)
    (located ws2 loc2)
    (located ws3 loc2)
    (located ws4 loc3)

    ; central_warehouse and loc1 are connected
    (connected central_warehouse loc1)
    (connected loc1 central_warehouse)
    ; central_warehouse and loc2 are connected
    (connected central_warehouse loc2)
    (connected loc2 central_warehouse)
    ; loc3 connected to loc2
    (connected loc3 loc2)
    (connected loc2 loc3)


    ; needs == not have     
    ; ws1 needs only tool
    (needs ws1 tool)

    ; ws2 needs no supply
    
    ; ws3 needs bolt valve tool
    (needs ws3 bolt)
    (needs ws3 valve)
    (needs ws3 tool)

    ; ws4 needs valve
    (needs ws4 valve)

    ; define increnet decrement predicates
    (inc q0 q1) (inc q1 q2) (inc q2 q3) (inc q3 q4)
    (dec q4 q3) (dec q3 q2) (dec q2 q1) (dec q1 q0)
)

(:goal (and
    ; ws1 has tool
    (has ws1 tool)

    ; ws2 not need supply
    
    ; ws3 has bolt valve tool
    (has ws3 bolt)
    (has ws3 valve)
    (has ws3 tool)

    ; ws4 has valve
    (has ws4 valve)
))

)

; plan
1. (fill agent1 box1 tool central_warehouse)
   deleted: (isempty box1)
   added: (contains box1 tool)
   goals met: 0 of 5
2. (load-filled agent1 carrier1 box1 central_warehouse q3 q2 q0 q1)
   deleted: (unloaded box1) (located box1 central_warehouse) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   added: (loaded carrier1 box1) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   goals met: 0 of 5
3. (fill agent1 box2 valve central_warehouse)
   deleted: (isempty box2)
   added: (contains box2 valve)
   goals met: 0 of 5
4. (move-carrier-to-workstations agent1 carrier1 central_warehouse loc1)
   deleted: (located agent1 central_warehouse) (located carrier1 central_warehouse)
   added: (located agent1 loc1) (located carrier1 loc1)
   goals met: 0 of 5
5. (unload-filled agent1 carrier1 box1 loc1 q2 q3 q1 q0)
   deleted: (loaded carrier1 box1) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   added: (unloaded box1) (located box1 loc1) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   goals met: 0 of 5
6. (empty agent1 box1 tool ws1 loc1)
   deleted: (needs ws1 tool) (contains box1 tool)
   added: (has ws1 tool) (isempty box1)
   goals met: 1 of 5
7. (load-empty agent1 carrier1 box1 loc1 q3 q2)
   deleted: (unloaded box1) (located box1 loc1) (available_slots carrier1 q3)
   added: (loaded carrier1 box1) (available_slots carrier1 q2)
   goals met: 1 of 5
8. (move-carrier-to-warehouse agent1 carrier1 loc1 central_warehouse)
   deleted: (located agent1 loc1) (located carrier1 loc1)
   added: (located agent1 central_warehouse) (located carrier1 central_warehouse)
   goals met: 1 of 5
9. (unload-empty agent1 carrier1 box1 central_warehouse q2 q3)
   deleted: (loaded carrier1 box1) (available_slots carrier1 q2)
   added: (unloaded box1) (located box1 central_warehouse) (available_slots carrier1 q3)
   goals met: 1 of 5
10. (load-filled agent1 carrier1 box2 central_warehouse q3 q2 q0 q1)
   deleted: (unloaded box2) (located box2 central_warehouse) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   added: (loaded carrier1 box2) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   goals met: 1 of 5
11. (fill agent1 box1 bolt central_warehouse)
   deleted: (isempty box1)
   added: (contains box1 bolt)
   goals met: 1 of 5
12. (load-filled agent1 carrier1 box1 central_warehouse q2 q1 q1 q2)
   deleted: (unloaded box1) (located box1 central_warehouse) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   added: (loaded carrier1 box1) (available_slots carrier1 q1) (current_filled_boxes carrier1 q2)
   goals met: 1 of 5
13. (fill agent1 box3 tool central_warehouse)
   deleted: (isempty box3)
   added: (contains box3 tool)
   goals met: 1 of 5
14. (load-filled agent1 carrier1 box3 central_warehouse q1 q0 q2 q3)
   deleted: (unloaded box3) (located box3 central_warehouse) (available_slots carrier1 q1) (current_filled_boxes carrier1 q2)
   added: (loaded carrier1 box3) (available_slots carrier1 q0) (current_filled_boxes carrier1 q3)
   goals met: 1 of 5
15. (move-carrier-to-workstations agent1 carrier1 central_warehouse loc2)
   deleted: (located agent1 central_warehouse) (located carrier1 central_warehouse)
   added: (located agent1 loc2) (located carrier1 loc2)
   goals met: 1 of 5
16. (unload-filled agent1 carrier1 box1 loc2 q0 q1 q3 q2)
   deleted: (loaded carrier1 box1) (available_slots carrier1 q0) (current_filled_boxes carrier1 q3)
   added: (unloaded box1) (located box1 loc2) (available_slots carrier1 q1) (current_filled_boxes carrier1 q2)
   goals met: 1 of 5
17. (unload-filled agent1 carrier1 box2 loc2 q1 q2 q2 q1)
   deleted: (loaded carrier1 box2) (available_slots carrier1 q1) (current_filled_boxes carrier1 q2)
   added: (unloaded box2) (located box2 loc2) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   goals met: 1 of 5
18. (unload-filled agent1 carrier1 box3 loc2 q2 q3 q1 q0)
   deleted: (loaded carrier1 box3) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   added: (unloaded box3) (located box3 loc2) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   goals met: 1 of 5
19. (empty agent1 box1 bolt ws3 loc2)
   deleted: (needs ws3 bolt) (contains box1 bolt)
   added: (has ws3 bolt) (isempty box1)
   goals met: 2 of 5
20. (load-empty agent1 carrier1 box1 loc2 q3 q2)
   deleted: (unloaded box1) (located box1 loc2) (available_slots carrier1 q3)
   added: (loaded carrier1 box1) (available_slots carrier1 q2)
   goals met: 2 of 5
21. (empty agent1 box3 tool ws3 loc2)
   deleted: (needs ws3 tool) (contains box3 tool)
   added: (has ws3 tool) (isempty box3)
   goals met: 3 of 5
22. (move-carrier-to-warehouse agent1 carrier1 loc2 central_warehouse)
   deleted: (located agent1 loc2) (located carrier1 loc2)
   added: (located agent1 central_warehouse) (located carrier1 central_warehouse)
   goals met: 3 of 5
23. (unload-empty agent1 carrier1 box1 central_warehouse q2 q3)
   deleted: (loaded carrier1 box1) (available_slots carrier1 q2)
   added: (unloaded box1) (located box1 central_warehouse) (available_slots carrier1 q3)
   goals met: 3 of 5
24. (fill agent1 box1 valve central_warehouse)
   deleted: (isempty box1)
   added: (contains box1 valve)
   goals met: 3 of 5
25. (load-filled agent1 carrier1 box1 central_warehouse q3 q2 q0 q1)
   deleted: (unloaded box1) (located box1 central_warehouse) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   added: (loaded carrier1 box1) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   goals met: 3 of 5
26. (move-carrier-to-workstations agent1 carrier1 central_warehouse loc2)
   deleted: (located agent1 central_warehouse) (located carrier1 central_warehouse)
   added: (located agent1 loc2) (located carrier1 loc2)
   goals met: 3 of 5
27. (empty agent1 box2 valve ws3 loc2)
   deleted: (needs ws3 valve) (contains box2 valve)
   added: (has ws3 valve) (isempty box2)
   goals met: 4 of 5
28. (move-carrier-to-workstations agent1 carrier1 loc2 loc3)
   deleted: (located agent1 loc2) (located carrier1 loc2)
   added: (located agent1 loc3) (located carrier1 loc3)
   goals met: 4 of 5
29. (unload-filled agent1 carrier1 box1 loc3 q2 q3 q1 q0)
   deleted: (loaded carrier1 box1) (available_slots carrier1 q2) (current_filled_boxes carrier1 q1)
   added: (unloaded box1) (located box1 loc3) (available_slots carrier1 q3) (current_filled_boxes carrier1 q0)
   goals met: 4 of 5
30. (empty agent1 box1 valve ws4 loc3)
   deleted: (needs ws4 valve) (contains box1 valve)
   added: (has ws4 valve) (isempty box1)
   goals met: 5 of 5
